run/966ox/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<expoHeterogeneous>;

solidComponents
(
  ceria cered
);

ceriaCoeffs
{
    transport
    {
		K0 			0.1725; 
		Tref		273.;
		n0			1.2853; 
    }
    thermodynamics
    {
        C0			444.27;
		Tref		273.;
		n0			0.;
		Hf          1.;
    }
    density
    {
        rho           2850.; 
    }
};

ceredCoeffs
{
    transport
    {
		K0          0.1725; 
        Tref        273.;
        n0          1.2853; 
    }
    thermodynamics
    {
        C0			489.84;
		Tref		273.;
		n0			0.;
		Hf          0.;
    }
    density
    {
        rho           2585.;
    }
};


// ************************************************************************* //
