run/966ox/0.orig/AR
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ar;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.9451;
    }
    
	outlet
    {
        type            zeroGradient;
    }
    
	tubeWall
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    negZside
    {
        type            wedge;
    }
    posZside
    {
        type            wedge;
    }
}


// ************************************************************************* //
