run/966ox/0.orig/Ycered
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "900";
    object      Ycered;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
480
(
0.0746037
0.0753611
0.0770296
0.0791261
0.0813627
0.0836001
0.085771
0.08784
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    negZside
    {
        type            wedge;
    }
    posZside
    {
        type            wedge;
    }
    tubeWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
