run/966ox/0.orig/Yceredm
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "900";
    object      Yceredm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
480
(
96.2183
97.1878
99.3226
102.004
104.864
107.723
110.496
113.137
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            empty;
    }
    negZside
    {
        type            wedge;
    }
    posZside
    {
        type            wedge;
    }
    tubeWall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
