run/966ox/0.orig/Yceria
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "900";
    object      Yceria;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
480
(
0.925396
0.924639
0.92297
0.920874
0.918637
0.9164
0.914229
0.91216
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    negZside
    {
        type            wedge;
    }
    posZside
    {
        type            wedge;
    }
    tubeWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
