run/966ox/0.orig/deltaField
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "900";
    object      deltaField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
480
(
0.0816305
0.0824529
0.0842641
0.086539
0.088965
0.0913906
0.0937431
0.0959842
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    negZside
    {
        type            wedge;
    }
    posZside
    {
        type            wedge;
    }
    tubeWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
